#+BEGIN_COMMENT
.. title: Word Embeddings: Shakespeare Data
.. slug: word-embeddings-shakespeare-data
.. date: 2020-12-13 12:44:32 UTC-08:00
.. tags: word-embeddings-build-a-model
.. category: NLP
.. link: 
.. description: Setting up the Shakespeare data.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-e9fd563e-0c2c-4c68-8114-3da404e925f6-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** The Cleaned
#+begin_src python :results output :exports both
from neurotic.nlp.word_embeddings import DataCleaner
cleaner = DataCleaner()
print(cleaner.unpunctuated[:50])
print(cleaner.tokens[:10])
print(cleaner.processed[:10])
print(f"Tokens: {len(cleaner.processed):,}")
#+end_src   

#+RESULTS:
: O for a Muse of fire. that would ascend
: The bright
: ['O', 'for', 'a', 'Muse', 'of', 'fire', '.', 'that', 'would', 'ascend']
: ['o', 'for', 'a', 'muse', 'of', 'fire', '.', 'that', 'would', 'ascend']
: Tokens: 60,996
** The Data Data
#+begin_src python :results output :exports both
from neurotic.nlp.word_embeddings import MetaData
counter = MetaData(cleaner.processed)

print(f"Size of vocabulary: {len(counter.distribution):,}")
for token in counter.distribution.most_common(20):
    print(f" - {token}")
words = len(counter.distribution)
expect(len(counter.vocabulary)).to(equal(words))
expect(len(counter.word_to_index)).to(equal(words))
print(f"Size of the Vocabulary: {len(counter.vocabulary):,}")

index = random.randrange(words)
word = counter.vocabulary[index]
expect(index).to(equal(counter.word_to_index[word]))
#+end_src

#+RESULTS:
#+begin_example
Size of vocabulary: 5,778
 - ('.', 9630)
 - ('the', 1521)
 - ('and', 1394)
 - ('i', 1257)
 - ('to', 1159)
 - ('of', 1093)
 - ('my', 857)
 - ('that', 781)
 - ('in', 770)
 - ('a', 752)
 - ('you', 748)
 - ('is', 630)
 - ('not', 559)
 - ('for', 467)
 - ('it', 460)
 - ('with', 441)
 - ('his', 434)
 - ('but', 417)
 - ('me', 417)
 - ('your', 397)
Size of the Vocabulary: 5,778
#+end_example

